read_verilog ../rtl/horus_tile.v
read_verilog ../rtl/fp8_e4m3_mul.v
read_verilog ../rtl/horus_e3m6_core.v
read_verilog ../rtl/horus_norm_v2.v
synth -top horus_tile
dfflibmap -liberty @LIBERTY@
abc -liberty @LIBERTY@
clean
stat -liberty @LIBERTY@
